config.org
#+title: Emacs Configuration

This is my literate emacs confguration which I intend  to use for all of my computing needs.

* Introduction
** Package Management

This is where this configuration differs from most others. Emacs has a wide variety of package management solutions, internally like ~package.el~ or externally like ~use-package~ or ~straight.el~. However, the problem persists is that any emacs configuration has implied external dependencies, say nodejs for writing javascript projects.  Where I differ is that I use Nix to manage both of the elisp package dependencies and the external dependencies. This is the general rule but a large exception is where software projects using Nix also maintain their own dependencies using shell hooks. This would also be a good idea to incorporate where a project buffer rationalises whethers the project is /"nixified"/ and if not will attempt to download those dependencies, or at least make the user aware that it is not available.  Not to digress, because the elisp packages are pre-installed, all that has to be done is to ~require~ them in a file and so removes a lot of unneccessary juggling of ~use-package~.

As this is a nixified emacs literate config, I use a flake to define an emacs package which contains all required dependencies. This may also be moved to inside my notes as externally referencing pieces of my configuration could be useful for blogging/research.

One pain point which may manifest is that the emacs-overlay which the flake uses becomes unmaintained or does not declare a package I want. A workaround could be to use ~straight.el~.

** Useful Links

- http://alhassy.com/emacs.d/index.html
- https://gitlab.com/public-repositories/emacs-groundup
- https://github.com/alphapapa/unpackaged.el
- http://honnef.co/articles/my-org-roam-workflows-for-taking-notes-and-writing-articles
- https://karelvo.com/blog/2023-02-17-orgmode
- https://www.sobyte.net/post/2022-05/emacs-package/
- https://www.brettwitty.net/exocortex.html
- https://github.com/technomancy/emacs-starter-kit  
- https://nullprogram.com/blog/2017/01/30/
- Prefer custom-set-variable(s) over setq https://emacs.stackexchange.com/questions/102/advantages-of-setting-variables-with-setq-instead-of-custom-el
- Similar to above, use setopt for emacs 29+ https://emacs.stackexchange.com/questions/78419/im-unsure-which-option-to-use-for-setting-a-variable-setq-customize-set-varia/78424#78424
- https://github.com/frap/emacs-literate
- Uses nix! https://panadestein.github.io/emacsd/
- https://github.com/caisah/emacs.dz
- https://github.com/alopezrivera/Seaman-Emacs/blob/main/seaman/seaman.org#base-configuration 
- https://emacsdocs.org/

* Prerequisites

Firstly, the configuration listed here should be executed first

** Emacs Configuration Header

Emacs has a [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Library-Headers.html][convention]] which must be complied with when publishing elisp code.

#+begin_src emacs-lisp
;;; config.el --- Padraic's Emacs configuration -*- lexical-binding: t -*-

;; Copyright (C) 2023-2023 Patrick H Morris

;; Author: Patrick H Morris <patrick.morris.310@gmail.com>
;; Keywords: internal
;; URL: https://panadestein.github.io/emacsd/

;;; Commentary:
;; A fully fledged, reproducible Emacs configuration

;;; Code:
#+end_src

Note that this also specifies the usage of lexical binding. See https://nullprogram.com/blog/2016/12/22/ for an explaination. This should always be placed at the top of the file.

** Require locally defined functions

The function section places functions in a different file, ~functions.el~ which should be loaded at the start.

#+begin_src emacs-lisp
(load-file (concat user-emacs-directory "functions.el"))
#+end_src

** Disable Magic File Names on Startup

The ~file-name-handler-alist~ is a special variable containing lookup keys for handlers when accessing a particular file, it's not used at startup so we can disable it temporarily.

#+begin_src emacs-lisp
(defvar file-name-handler-alist-original file-name-handler-alist)
(setq file-name-handler-alist nil)
#+end_src

Restore it later using the ~emacs-startup-hook~

#+begin_src emacs-lisp
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq file-name-handler-alist file-name-handler-alist-original)))
  #+end_src

** Garbage Collection

We set the gc threshold to ~most-positive-fixnum~, which is the largest representable positive integer in elisp. Also increasing ~gc-cons-percentage~ increases memory usage before garbage collection.

#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
#+end_src

Assign variable for the desired gc threshold

#+begin_src emacs-lisp
(defvar pm/gc-cons-threshold 100000000)
#+end_src

Reset gc once emacs has initialised

#+begin_src emacs-lisp
(add-hook 'emacs-startup-hook ; hook run after loading init files
          (lambda ()
            (setq gc-cons-threshold pm/gc-cons-threshold
                  gc-cons-percentage 0.1
                  file-name-handler-alist file-name-handler-alist-original)))
#+end_src

Ensure minibuffer operations are smooth

#+begin_src emacs-lisp
(add-hook 'minibuffer-setup-hook
          #'(lambda ()
              (setq gc-cons-threshold (* pm/gc-cons-threshold 2))))
(add-hook 'minibuffer-exit-hook
          #'(lambda ()
              (garbage-collect)
              (setq gc-cons-threshold pm/gc-cons-threshold)))
#+end_src

** Native Compilation

Check if native compilation is available for this emacs instance and if so configures native compilation settings and the path for where the compiled elisp files are stored which is the users emacs directory.

#+begin_src emacs-lisp
(when (and (fboundp 'native-comp-available-p) (native-comp-available-p))
  (progn
    (setq native-comp-async-report-warnings-errors nil)
    (setq native-comp-deferred-compilation t)
    (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))
    (setq package-native-compile t)))
#+end_src

This block might be unnecessary.

** Initialization Flag

This is a useful variable which can be used to mitigate issues surrounding reloading of the confi

#+begin_src emacs-lisp
(defvar pm/initialized nil)

(add-hook 'emacs-startup-hook
          #'(lambda ()
              (setq pm/initialized t)))
#+end_src

* Basic Emacs Settings

Modifications to the default emacs settings should exist here. No
external package should be referenced.

** Personal Configuration

Basic user information

#+begin_src emacs-lisp
(setq user-full-name "Patrick H Morris"
      user-mail-address "patrick.morris.310@gmail.com")
#+end_src 

** Init Files

Emacs has a variety of conventions of files which should be loaded and where certain configuration can exist. Anything related to that behaviour should go here

*** Default.el

This is quite important in context of how this emacs configuration is defined. This file may be used to generate a ~default.el~ file which is custom packaged with emacs. In such cases, having this setting be true would prevent that file from loading.

#+begin_src emacs-lisp
(setq inhibit-default-init t)
#+end_src

*** Custom.el

Define the custom file to exist within the user's emacs directory

#+begin_src emacs-lisp
(let ((customization-file
       (expand-file-name "custom.el" user-emacs-directory)))
  (unless (file-exists-p customization-file)
    (write-region "" nil customization-file))
  (setq custom-file customization-file)
  (load custom-file 'noerror))
#+end_src

https://panadestein.github.io/emacsd/#orgaf16e18

** Startup

Prevent the startup screen containing Emacs specific content/documentation/links

#+begin_src emacs-lisp
(setq inhibit-startup-message t)
#+end_src

Prevent the echo area startup message. ~inhibit-startup-echo-area-message~ has little to no affect, maybe for advertising reasons, either way the source of the message is in the function ~display-startup-echo-area-message~ which is overrided here in order to change the message.

#+begin_src emacs-lisp
(defun display-startup-echo-area-message ()
  (display-startup-time))
#+end_src

*** Initial Buffer

Decide what buffers should be opened by default. When customising emacs it is easiest to open this file and the messages buffer for any information

#+begin_src emacs-lisp
(setq initial-buffer-choice "~/.config/emacs/config.org")
#+end_src

**** TODO Define a sensible startup system

Maybe Agenda/Daily?

*** Scratch Buffer

Make the scratch buffer empty by default

#+begin_src emacs-lisp
(setq initial-scratch-message nil)
#+end_src

** File/Buffer/Text Behaviour

Configuration pertaining to global file behaviour should go here

*** Large File Warnings
Warn when opening files greater than 100MB

#+begin_src emacs-lisp
(setq large-file-warning-threshold 100000000)
#+end_src

*** Respect File Mutation

Should a file be modified outside of Emacs, always respect those changes. Also check for file changes every second, if this becomes an issue for performance, increase

#+begin_src emacs-lisp
(global-auto-revert-mode t)
(setq auto-revert-interval 1)
#+end_src

*** Always use UTF8

#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
#+end_src

*** Don't Make Backups

#+begin_src emacs-lisp
(setq make-backup-files nil)
#+end_src

*** End Sentence with Single Space

#+begin_src emacs-lisp
(setq sentence-end-double-space nil)
#+end_src
*** Don't save modified buffers on exit

If a buffer is "unsaved" when killing it, you will get an annoying prompt to save. If not saved, I want to just kill immediately

#+begin_src emacs-lisp
(defun pm/suppress-save-buffer-query-function ()
  (set-buffer-modified-p nil)
  t) ; Return t so other functions in kill-buffer-query-functions get called.

(add-to-list 'kill-buffer-query-functions 'pm/suppress-save-buffer-query-function)
#+end_src

** UI

*** Remove Features

Emacs by default comes with a clunky ugly interface, remove those features.

#+begin_src emacs-lisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)
(menu-bar-mode -1)
#+end_src

*** Bell Modifications

Emacs comes with an audible bell sound when a user does someting erroneous. Having this be a visual feature is preferred.

#+begin_src emacs-lisp
(setq visible-bell t)
#+end_src

Disable it to be sure

#+begin_src emacs-lisp
(setq ring-bell-function 'ignore)
#+end_src

*** Mitigate Blinking Cursor

#+begin_src emacs-lisp
(blink-cursor-mode -1)
#+end_src
*** Scrolling

#+begin_src emacs-lisp
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)
#+end_src
** Y/N Prompt

Ensure all yes/no type queries can be answered with y/n

#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src
** Debugging

Emacs enables debugging using the ~--debug-init~ flag. The configuration below increases the verbosity of warnings in such contexts.

#+begin_src emacs-lisp
(if init-file-debug
    (setq warning-minimum-level :debug)
  (setq warning-minimum-level :emergency))
#+end_src
** History

~savehist~ (short for "save history") is a built-in feature of Emacs that allows you to persistently save various history lists across Emacs sessions. This means that things like your command history, search history, and other similar histories can be remembered even after you close and restart Emacs.

#+begin_src emacs-lisp
(require 'savehist)
(savehist-mode)
#+end_src
** Littering

~no-littering~ sets sane defaults for a host of backup files etc that can build up

#+begin_src emacs-lisp
(require 'no-littering)
#+end_src

* Keybindings

It is better to define the keybinding system early as subsequent
functionality is dependent

** ~general.el~

~general~ is a keybinding framework for emacs and is complementary to evil mode users. ~SPC~ will be a global key to manage a lot of behaviour

#+begin_src emacs-lisp
(require 'general)
(general-evil-setup t)

(general-create-definer pm/leader
  :keymaps '(normal insert visual emacs)
  :prefix "SPC"
  :global-prefix "C-SPC")
#+end_src

