config.org
** ~which-key~

~which-key~ enhances the Emacs experience by providing real-time, interactive feedback on keybindings, making it easier to navigate and use the vast array of commands and functionalities available in the editor.

#+begin_src emacs-lisp
(require 'which-key)
(which-key-mode)
(setq which-key-idle-delay 0)
#+end_src
** Global Keybindings

Here is a space for defining all global keybindings

*** Bucket

For keybindings which haven't found their place in the config.

#+begin_src emacs-lisp
(pm/leader
  "r" '(pm/reload-config :which-key "Reload config")
  "u" '(:ignore t :which-key "ui")
  "ut" '(counsel-load-theme :which-key "Select Theme"))
#+end_src

*** Esc Acts as Quit

By default, ~C-g~ will quit a process which is slightly more work than ~<escape>~

#+begin_src emacs-lisp
(general-define-key
 "<escape>" 'keyboard-escape-quit)
#+end_src

* Display

Configuration regarding the emacs appearence should go here

** Theme

doom-themes is a popular collection of emacs themes. 

#+begin_src emacs-lisp
(require 'doom-themes)
(setq doom-themes-enable-bold t    
      doom-themes-enable-italic t)

(unless pm/initialized (load-theme 'doom-nord-aurora t)) 
(doom-themes-visual-bell-config)
(doom-themes-org-config)
#+end_src
** Font

Iosevka is a nice font

#+begin_src emacs-lisp
(set-face-attribute 'default nil :font "Iosevka Comfy Fixed" :height 100)
#+end_src 

** Icons

#+begin_src emacs-lisp
(require 'all-the-icons)
#+end_src

** Modeline

Also borrowing from the doom collection

#+begin_src emacs-lisp
(require 'doom-modeline)
(doom-modeline-mode t)
(setq doom-modeline-height 55)
(setq doom-modeline-buffer-file-name-style 'relative-to-project)
(setq doom-line-numbers-style 'relative)
(setq doom-modeline-major-mode-icon t)
(setq doom-modeline-buffer-state-icon t)
(setq doom-modeline-major-mode-color-icon t)
(setq doom-modeline-window-width-limit nil)
#+end_src
** Windows
*** Fringe

The "fringe" is the narrow vertical areas on either side of windows

#+begin_src elisp
(set-fringe-mode 0)
#+end_src
*** Winner

#+begin_src elisp
(require 'winner)
(winner-mode t)
#+end_src
*** Selection

#+begin_src emacs-lisp
(require 'ace-window)
(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
#+end_src
* Editing

File editing is the most important thing an editor does right?!?!

** Text Behaviour
*** Long Lines

Emacs has historically had severe performance issues with files that contain long lines.

#+begin_src emacs-lisp
(require 'so-long)
#+end_src

Add the global mode once initialisation has finished as it 

#+begin_src emacs-lisp
(add-hook 'after-init-hook 'global-so-long-mode)
#+end_src

*** Filling/Wrapping

Define a variable to be used to specify column width

"Filling" refers to the process of breaking lines of text to fit within a specified width, which is typically the value of the ~fill-column~ variable. This action ensures that text is neatly wrapped and presented within the confines of a set width, making it more readable and visually organized, especially in text modes.

#+begin_src emacs-lisp
(setq fill-column 80)
#+end_src

It is probably not desirable to fill unless the user specifies directly. Enabling visual line wrapping is preferable as it does not alter the file in order to make the editing experience more appealing. The desired effect can be achieved using ~visual-line-mode~ which wraps text which goes past a certain point but maintains the same line. "Filling" can be opted in using one of the many commands like ~evil-fill~ 

Wrapping is where text is shown on the same line but the pane width is respected such that the line "wraps" around the screen. ~visual-line-mode~ is a minor mode in Emacs that affects how lines of text are displayed in the buffer, without modifying the actual content of the file. When this mode is enabled, long lines of text are visually wrapped at the edge of the window, making them appear as multiple lines on the screen, even though they remain a single line in the file.

We only want to turn this on for text and programming modes as things like the minibuffer and terminals should not need to do this

#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'visual-line-mode)
(add-hook 'prog-mode-hook 'visual-line-mode)
#+end_src

However, ~visual-line-mode~ will wrap only at the window edge which could mean arbitrarily long lines if the window is the full screen width. Alternatively, using ~visual-fill-column~ package allows for soft wrapping at a specific column which is referenced by ~pm/column-width~. This should make text wrapping occur at that column width or if the pane is smaller. This should make for a better reading experience.

https://codeberg.org/joostkremers/visual-fill-column

Here, I've increased the column width as the default ~fill-column~ is too narrow at 80. Most programming modes ought to provide their own prettification tooling which should override any text wrapping. "Filling" can be left manual and only used when align code commentary or things of that ilk.

#+begin_src emacs-lisp
(require 'visual-fill-column)
(add-hook 'visual-line-mode-hook
          #'(lambda ()
              (setq visual-fill-column-width 140) 
              (visual-fill-column-mode)))
#+end_src

https://github.com/seagle0128/doom-modeline/issues/672

Always ensure that the modeline is aligned as far right
#+begin_src emacs-lisp
(setq mode-line-right-align-edge 'right-fringe)
#+end_src

*** Tabs vs Spaces

Don't trust tabs

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq tab-width 2)
#+end_src

The tab-always-indent variable essentially allows users to configure a balance between indentation and completion behaviors, based on their preferences and workflow. Some users prefer the TAB key to prioritize indentation, while others might want it to emphasize completion, especially in modes or contexts where completion is frequently used.

When ~tab-always-indent~ is set to ~complete~, pressing TAB will first try to indent the current line. If the line is already correctly indented, or if the point isn't at the beginning of a line, Emacs will then try to perform completion.

#+begin_src emacs-lisp
(setq-default tab-always-indent 'complete)
#+end_src

** ~evil~

For those who like to use vim in emacs

#+begin_src emacs-lisp
(setq evil-want-integration t)
(setq evil-want-keybinding nil)
(setq evil-want-C-u-scroll t)
(setq evil-want-C-i-jump nil)
(setq evil-undo-system 'undo-tree)

(require 'evil)
(evil-mode 1)

(require 'evil-collection)
(evil-collection-init)

(evil-set-initial-state 'messages-buffer-mode 'normal)
(evil-set-initial-state 'dashboard-mode 'normal)
#+end_src

#+begin_src emacs-lisp
(general-def 'evil-insert-state-map
  "C-g" 'evil-normal-state
  "C-h" 'evil-delete-backward-char-and-join)

(general-define-key 
 :states 'motion
 "j" 'evil-next-visual-line
 "k" 'evil-previous-visual-line)
#+end_src

** ~undo-tree~

A very nice visualisation tool for tracing file changes in a tree hierarchy

#+begin_src emacs-lisp
(require 'undo-tree)
(general-define-key
 "C-x u" 'undo-tree-visualize)

(global-undo-tree-mode)
(setq undo-tree-visualizer-timestamps t)
(setq undo-tree-visualizer-diff t)
(setq undo-tree-show-help-in-visualize-buffer t)
(setq undo-tree-auto-save-history t)
(setq undo-tree-history-directory-alist `(("." . ,(concat user-emacs-directory "undo"))))
#+end_src

* Git
** ~magit~

The best git gui ever made

#+begin_src emacs-lisp
(require 'magit)
(setopt magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1) ; What does this do?
#+end_src

#+begin_src emacs-lisp
(pm/leader
  "m" '(:ignore t :which-key "magit")
  "mm" '(magit-status :which-key "status"))
#+end_src
* Org

/Org/ is a versatile and powerful mode in Emacs designed for keeping notes, maintaining to-do lists, planning projects, and authoring documents. It's built around a plain-text formatting system, making it platform-independent and easily readable outside of Emacs. Over the years, /Org/ has evolved into a robust toolset that can handle everything from personal task management to publishing, coding, and even scientific research.

#+begin_src emacs-lisp
(require 'org)
#+end_src

Also create a general.el keybind for org mode contexts

#+begin_src emacs-lisp
(pm/leader
  "o" '(:ignore t :which-key "org"))
#+end_src

** Appearence and Behaviour

*** Ellipsis

Replaces the default content marker, "⋯", with a nice unicode arrow.

#+begin_src emacs-lisp
(setq org-ellipsis " ⤵")
#+end_src

*** Bullets

/Org-bullets/ is an Emacs package designed to enhance the visual appearance of Org-mode documents by replacing the standard asterisks (*) used for headlines with more visually appealing bullet characters.

#+begin_src emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

*** Indentation

Content under org headings will be indented such that it is clear under which heading content is nested.

#+begin_src emacs-lisp
(setq org-startup-indented t)
(add-hook 'org-mode-hook 'org-indent-mode)
#+end_src

*** Markers

Markers relate to the markup syntax used to provide different kinds of text styling.

#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

**** TODO Add a font which works well with the different kinds of syntax highlighting

*** Code Blocks

In Org mode within Emacs, code blocks (often referred to as "source blocks") allow for the inclusion of source code from various programming languages. These blocks can be used for documentation, literate programming, or for dynamically generating content within an Org document.

One of the powerful features of source blocks in Org mode is that they can be executed. By placing the cursor within a source block and pressing C-c C-c, you can run the code if Emacs is configured to support that particular language. The results can be inserted directly into the Org document.

**** Template Tab Completion

Since org-mode 9.2, the completion ~<s TAB~ does not work out of the box and so org-tempo is required

Also adds the completion for elisp source code blocks using ~<el TAB~

#+begin_src emacs-lisp
(require 'org-tempo)
(add-to-list 'org-structure-template-alist
             '("el" . "src emacs-lisp"))
#+end_src

**** Indentation

Ensures that source code blocks are aligned with the left-most column.

#+begin_src emacs-lisp
(setq org-src-preserve-indentation t)
#+end_src

Make Tab respect indentation of the major mode for the lang

#+begin_src emacs-lisp
(setq org-src-tab-acts-natively t)
#+end_src

**** Evaluation

Don't ask permission to evaluate. Evaluation can be done using the Keybinding ~C-c C-c.~

#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src

*** Folding

Fold headings at start

#+begin_src emacs-lisp
(setq org-startup-folded t)
#+end_src

*** Timestamp

We always want to record for each org file when it was last edited

#+begin_src emacs-lisp
(require 'time-stamp)

(setq time-stamp-active t)
(setq time-stamp-start "#\\+last_modified:[ \t]")
(setq time-stamp-end "$")
(setq time-stamp-format "\[%Y-%m-%d %a %H:%M\]")

(add-hook 'before-save-hook #'time-stamp)
#+end_src

*** Links

Naked urls are fine but it is preferred to use ~org-cliplink~ as a way to gather extra info

#+begin_src emacs-lisp
(require 'org-cliplink)
#+end_src

*** Graphs

#+begin_src emacs-lisp
(setq ob-mermaid-cli-path (getenv "MERMAID_CLI"))
(add-to-list 'org-babel-load-languages '(mermaid . t))

(add-to-list 'org-structure-template-alist
             '("mrm" . "src mermaid :file /tmp/test.png"))
#+end_src

**** TODO Add inline images for  working!!
*** Miscellaneous

Prevents edits to content hidden under a folded heading

#+begin_src emacs-lisp
(setq org-catch-invisible-edits t)
#+end_src

** Tasks

Org mode in Emacs for task management is a powerful way to organize, prioritize, and track tasks and projects. The flexibility of Org mode allows users to create a system tailored to their unique needs.

