config.org
***** Basic Note Template
#+begin_src emacs-lisp
(defvar pm/basic-note-template
  `("d" "" plain
    pm/note-basic-entry
    :target ,pm/basic-note-target
    :unnarrowed t
    :empty-lines-before 1))
#+end_src
*** Finding
**** Prompt

#+begin_src emacs-lisp
(defvar pm/note-find-prompt "<[Note]> ")
#+end_src
**** Leader key

#+begin_src emacs-lisp
(pm/leader
  "nf" '(:ignore t :which-key "find notes"))
#+end_src

**** Find matching note

Default org-roam has awkward fallback process when finding notes. If a note does not exist, it will immediately go into a capture process which is not exactly desired

#+begin_src emacs-lisp
(cl-defun pm/note-read (&key (initial-input nil)
                             (filter-fn nil)
                             (sort-fn nil)
                             (require-match nil)
                             (prompt pm/note-find-prompt))
  (org-roam-node-read initial-input filter-fn sort-fn require-match prompt))

(cl-defun pm/note-find ()
  (interactive)
  (org-roam-node-visit (pm/note-read :require-match t) t))

(pm/leader
  "nf" '(pm/note-find :which-key "find note"))
#+end_src

**** TODO Find note by tag(s)
**** TODO Find project notes
**** TODO Find people notes
**** TODO Find link notes
**** TODO Find daily notes
*** Searching
*** Capturing

Capturing is the central component to how the note system should work. Ideally, the flow should work as a way to automate editing or creation of notes in a simple form. 

**** Generic

A generic note is self-explanatory, just a basic unopinionated note type. As mentioned, there is two approaches, creating new notes and editing of currently existing notes. For capturing new notes:

#+begin_src emacs-lisp
(cl-defun pm/note-capture-new (&key node)
  (interactive)
  (if node
      (org-roam-capture-
       :goto nil
       :info nil
       :keys nil
       :templates `(("a" "Basic note" plain
                     ,pm/note-basic-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder)))
                    ("b" "Basic note + alias prompt" plain
                     ,pm/note-basic-entry
                     :target (file+head
                              ,pm/default-note-name-template
                              ,(pm/template-head-builder :aliases `("%^{ALIAS}"))))
                    ("c" "Basic note + tag prompt" plain
                     ,pm/note-basic-entry
                     :target (file+head
                              ,pm/default-note-name-template
                              ,(pm/template-head-builder :prompt-for-tags t)))
                    ("d" "Basic note + tag prompt + alias prompt" plain
                     ,pm/note-basic-entry
                     :target (file+head
                              ,pm/default-note-name-template
                              ,(pm/template-head-builder :prompt-for-tags t :aliases `("%^{ALIAS}")))))
       :node node
       :props '(:unnarrowed t :empty-lines-before 1))
    (user-error "Node cannot be nil!")))
#+end_src

And then for capturing to existing notes, also giving the option of going to the note

#+begin_src emacs-lisp
(cl-defun pm/note-capture-existing (&key node)
  (interactive)
  (if node
      (org-roam-capture-
       :goto nil
       :info nil
       :keys nil
       :templates `(("a" "Edit note" plain
                     ,pm/note-basic-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder)))
                    ("b" "Edit note + goto" plain
                     ,pm/note-basic-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder))
                     :jump-to-captured t)
                    ("c" "Insert TODO" entry
                     ,pm/note-todo-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder))
                     :prepend t
                     :empty-lines 1)
                    ("d" "Insert TODO + goto" entry
                     ,pm/note-todo-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder))
                     :prepend t
                     :empty-lines 1
                     :jump-to-captured t)
                    ("e" "Insert IDEA" entry
                     ,pm/note-idea-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder))
                     :prepend t
                     :empty-lines 1)
                    ("f" "Insert IDEA + goto" entry
                     ,pm/note-idea-entry
                     :target (file+head ,pm/default-note-name-template ,(pm/template-head-builder))
                     :prepend t
                     :empty-lines 1
                     :jump-to-captured t))
       :node node
       :props '(:unnarrowed t)) ;; 
    (user-error "Node cannot be nil!")))

#+end_src

Selection between templates is enshrined here:

#+begin_src emacs-lisp
(cl-defun pm/note-capture ()
  (interactive)
  (let ((node (pm/note-read)))
    (if (org-roam-node-file node)
        (pm/note-capture-existing :node node)
      (pm/note-capture-new :node node))))

(pm/leader
  "nc" '(pm/note-capture :which-key "capture note"))
#+end_src

**** Chores

Life notes are all encapsulated under a file ~chores.org~ as node headings. The purpose of this file is to capture daily administrative tasks which I have to do. 

#+begin_src emacs-lisp

(cl-defun pm/chore-capture ()
  (interactive)
  (let (
        (headings '("House" "Car" "Emails"))
        (node (org-roam-populate (org-roam-node-create :title "Chores"))))
    (org-roam-capture-
     :goto nil
     :info nil
     :keys nil
     :templates `(("a" "House" entry
                   ,pm/note-todo-entry
                   :target (file+head+olp
                            "chore.org"
                            ,(pm/template-head-builder
                              :tags '("chore")
                              :headings headings)
                            ,'("House")))
                  ("b" "Car" entry
                   ,pm/note-todo-entry
                   :target (file+head+olp
                            "chore.org"
                            ,(pm/template-head-builder
                              :tags '("chore")
                              :headings headings)
                            ,'("Car")))
                  ("c" "Emails" entry
                   ,pm/note-todo-entry
                   :target (file+head+olp
                            "chore.org"
                            ,(pm/template-head-builder
                              :tags '("chore")
                              :headings headings)
                            ,'("Emails"))))
     :node node
     :props '(:unnarrowed t))))


;; (cl-defun pm/project-capture ()
;;   (interactive)
;;   (let ((node (pm/project-read)))
;;     (if (org-roam-node-file node)
;;         (pm/project-capture-existing node)
;;       (pm/project-capture-new node))))

(pm/leader
  "nb" '(pm/chore-capture :which-key "capture chore"))

#+end_src

