config.org
*** Embark

https://github.com/oantolin/embark

Embark is an Emacs package that enhances the interactive experience by providing context-specific actions (or "embarkations") on targets, which can be anything from minibuffer completion candidates to text selected in a buffer. Essentially, it allows users to take various actions on different types of data in a context-aware manner. It's not specifically tied to a completion system but is also used heavily there in combination with some of the already listed configuration.

#+begin_src emacs-lisp
(require 'embark)
(require 'embark-consult)

(general-define-key
 "C-." 'embark-act
 "C-;" 'embark-dwim
 "C-h B" 'embark-bindings)

;; Optionally replace the key help with a completing-read interface
(setq prefix-help-command #'embark-prefix-help-command)
;; Show the Embark target at point via Eldoc.  You may adjust the Eldoc
;; strategy, if you want to see the documentation from multiple providers.
(add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)


(add-to-list 'display-buffer-alist
             '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
               nil
               (window-parameters (mode-line-format . none))))

(add-hook 'embark-collect-mode-hook 'consult-preview-at-point-mode)
#+end_src

* Programming Languages
** General Configuration
*** Syntax Highlighting
**** Numbers

When programming highlight numbers

#+begin_src emacs-lisp
(require 'highlight-numbers)
(add-hook 'prog-mode-hook 'highlight-numbers-mode)
#+end_src

**** Bracket Delimiters

Add rainbow matching to all delimiters

#+begin_src emacs-lisp
(require 'rainbow-delimiters)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+end_src

*** Line Numbers

List line-numbers by default and make it relative to cursor position

#+begin_src emacs-lisp
(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers 'relative)
#+end_src

Ensure a fixed width so that larger files don't interfere with the text in buffer alignment

#+begin_src emacs-lisp
(setq display-line-numbers-width-start t)
#+end_src

*** Bracket Delimiters

Especially useful for lisping

#+begin_src emacs-lisp
(require 'smartparens)
(add-hook 'prog-mode-hook 'smartparens-mode)
#+end_src
** Nix

Nix is a nice language

#+begin_src emacs-lisp
(require 'nix-mode)
(add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode))
#+end_src
** Elisp
* Utilities/Tools
** Profiling

~esup~, https://github.com/jschaf/esup is a tool used for profiling emacs startup time.

#+begin_src emacs-lisp
(require 'esup)
#+end_src

** Help

https://github.com/Wilfred/helpful

#+begin_src emacs-lisp
(require 'helpful)

(general-define-key
 "C-h f" 'helpful-function
 "C-h v" 'helpful-variable
 "C-h k" 'helpful-key)
#+end_src
* Functions

All functions here should be tangled into their own file, ~functions.el~ which can then be instantiated at the top of the generated ~config.el~. This will enforce that any function call can be referenced but keep the structure of this document intact.

** Reload Configuration
#+begin_src emacs-lisp ./functions.el
(defun pm/reload-config ()
  "Reloads the emacs configuration"
  (interactive)
  (load-file (concat user-emacs-directory "init.el")))
#+end_src
** Startup Time 

#+begin_src emacs-lisp :tangle ./functions.el
(defun display-startup-time ()
  (message "Emacs ready in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))
#+end_src
* Finalizations

Here is configuration which should end up at the end of the tangled file

** Emacs Configuration Footer

All elisp files should end with this

#+begin_src emacs-lisp
(provide 'config.el)
;;; config.el ends here
#+end_src

#+begin_src emacs-lisp :tangle ./functions.el
(provide 'functions.el)
;;; functions.el ends here
#+end_src
